rails-review-Dunder-Mifflin/app/views/employees/edit.html.erb


<%= f.collection_select :dog_id, Dog.all, :id, :name %>
---
SELECT "dogs".* FROM "dogs"