rails-review-Dunder-Mifflin/app/views/dogs/show.html.erb

<ul>
  <% @dog.employees.each do |employee| %>
---
SELECT "employees".* FROM "employees" WHERE "employees"."dog_id" = ?  [["dog_id", 1]]