rails-review-Dunder-Mifflin/app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"
---
def index
  @dogs = Dog.all

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def show
  @dog = Dog.find(params[:id])