rails-review-Dunder-Mifflin/app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)

    if @employee.valid?
      @employee.save
---
INSERT INTO "employees" ("first_name", "last_name", "alias", "title", "office", "img_url", "dog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @employee = Employee.find(params[:id])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    @employee = Employee.find(params[:id])
    if @employee.update(employee_params)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "employees" SET "office" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["office", "DC"], ["updated_at", "2018-11-08 20:38:36.083418"], ["id", 4]]